# Pandas Practice

In [1]:
import pandas as pd
import numpy as np

In [2]:
mydataset={
    'cars' : ['bmw','alto','tesla'],
    'passings': [4,6,6]
}
var=pd.DataFrame(mydataset)
print(var)

    cars  passings
0    bmw         4
1   alto         6
2  tesla         6

## Pandas Series

In [3]:
a=[1,3,34,5]
myvar=pd.Series(a, index=["x","y","z","k"])
print(myvar)
print(myvar['k'])

x     1
y     3
z    34
k     5
dtype: int64
5

## DatFrame
        *** A pandas dataframe is 2D data structure like table with rows and columns***

In [4]:
mydataset={
    'cars' : ['bmw','alto','tesla'],
    'passings': [4,6,6]
}
myvar=pd.DataFrame(mydataset)
# print(myvar)
# myvar

# pandas use the loc attribute to return one or more specified row (s)
print(myvar.loc[[0,2,1]])
# we can change the index name of the row like index=["a","b"] then excess by the name of itb

    cars  passings
0    bmw         4
2  tesla         6
1   alto         6

#Read CSV File
*** we use to_string()  funtion for read the all the data from the dataframe

In [5]:
print(pd.options.display.max_rows)

60

#Read Jason File
df=pd.read_json('data.json')
jason=python dictionary form

In [6]:
data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}
df=pd.DataFrame(data)
print(df)
# df.head() gives the uppper 5 data and df.tail() gives the lower 5 data
df.head(10)
print(df.info())

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300
<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  6 non-null      int64
 1   Pulse     6 non-null      int64
 2   Maxpulse  6 non-null      int64
 3   Calories  6 non-null      int64
dtypes: int64(4)
memory usage: 240.0+ bytes
None

In [31]:
data=pd.read_csv(r"C:\Users\ABHISHEK YADAV\Downloads\archive\choclateData.csv")
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1092 non-null   object
 2   Product        1091 non-null   object
 3   Date           1087 non-null   object
 4   Amount         1091 non-null   object
 5   Boxes Shipped  1092 non-null   float64
dtypes: float64(1), object(5)
memory usage: 51.4+ KB

#Analyze The Dataset

In [8]:
data.head(10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180.0
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,NaN,"$13,685",184.0
5,Van Tuxwell,India,Smooth Sliky Salty,06-Jun-22,"$5,376",NaN
6,Oby Sorrel,NaN,99% Dark & Pure,25-Jan-22,"$13,685",176.0
7,Gunar Cockshoot,Australia,After Nines,NaN,"$3,080",73.0
8,Jehu Rudeforth,New Zealand,50% Dark Bites,20-Apr-22,NaN,59.0
9,Brien Boise,Australia,99% Dark & Pure,04-Jul-22,"$2,835",102.0

In [9]:
print("How many null value")
print(data.isnull().sum())

How many null value
Sales Person     0
Country          2
Product          3
Date             7
Amount           3
Boxes Shipped    2
dtype: int64

In [10]:
print("The unique element :")
print(len(data['Country'].unique()))

The unique element :
7

In [11]:
print("The all value count of colums unique element")
print(data['Country'].value_counts())

The all value count of colums unique element
Country
Australia      204
India          184
USA            179
UK             177
Canada         175
New Zealand    173
Name: count, dtype: int64

## change the date from string to data time data dype

In [33]:
# print(data.info())
# data['Date']=pd.to_datetime(data['Date'])

data['Date']=data['Date'].astype('datetime64[ns]')
# data['Amount']=data['Amount'][1:]
# data['Amount']=data['Amount'].str.replace('[$,]','',regex=True).astype(int)
# data['Amount']=pd.to_numeric(data['Amount'])
# data['Amount']=data['Amount'].astype(int).slice[1:]
data.head(20)
# data.info()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,2022-01-04,"$5,320",180.0
1,Van Tuxwell,India,85% Dark Bars,2022-08-01,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,2022-07-07,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,2022-04-27,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,NaT,"$13,685",184.0
5,Van Tuxwell,India,Smooth Sliky Salty,2022-06-06,"$5,376",NaN
6,Oby Sorrel,NaN,99% Dark & Pure,2022-01-25,"$13,685",176.0
7,Gunar Cockshoot,Australia,After Nines,NaT,"$3,080",73.0
8,Jehu Rudeforth,New Zealand,50% Dark Bites,2022-04-20,NaN,59.0
9,Brien Boise,Australia,99% Dark & Pure,2022-07-04,"$2,835",102.0
10,Rafaelita Blaksland,UK,Smooth Sliky Salty,2022-01-13,"$4,704",62.0
11,Barr Faughny,USA,Orange Choco,2022-03-10,"$3,703",11.0
12,Mallorie Waber,Canada,Eclairs,2022-01-13,"$1,442",286.0
13,Karlen McCaffrey,New Zealand,Drinking Coco,2022-07-28,NaN,156.0
14,Marney O'Breen,New Zealand,Peanut Butter Cubes,2022-08-03,"$8,379",173.0
15,Beverie Moffet,NaN,Organic Choco Syrup,2022-01-26,"$6,790",356.0
16,Van Tuxwell,Canada,Organic Choco Syrup,2022-02-14,"$4,067",42.0
17,Roddy Speechley,USA,Smooth Sliky Salty,2022-04-05,"$3,017",140.0
18,Beverie Moffet,Canada,Milk Bars,2022-02-16,"$8,799",250.0
19,Curtice Advani,UK,85% Dark Bars,2022-06-08,"$1,085",172.0

In [13]:
# data['Date']=pd.to_datetime(data['Date'],format='%d-%m-%Y')
# data['Date']=data['Date'].str.strip()
# data['Date']=pd.to_datetime(data['Date'],errors='coerce')
# print(data.head())
# data['Date']=data['Date'].dt.year
# # print(data.info())
# print(data['Date'].unique())
# data['Date'].dtypes
# data['Date']=data['Date'].dt.year

In [14]:
for d in data['Date'] : 
    if(d==2022):
        print(d)

In [15]:
(data['Date']==2022).value_counts()

Date
False    1094
Name: count, dtype: int64

In [16]:
data.head(10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,2022-01-04,"$5,320",180.0
1,Van Tuxwell,India,85% Dark Bars,2022-08-01,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,2022-07-07,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,2022-04-27,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,NaT,"$13,685",184.0
5,Van Tuxwell,India,Smooth Sliky Salty,2022-06-06,"$5,376",NaN
6,Oby Sorrel,NaN,99% Dark & Pure,2022-01-25,"$13,685",176.0
7,Gunar Cockshoot,Australia,After Nines,NaT,"$3,080",73.0
8,Jehu Rudeforth,New Zealand,50% Dark Bites,2022-04-20,NaN,59.0
9,Brien Boise,Australia,99% Dark & Pure,2022-07-04,"$2,835",102.0

## Cleaning The Data

### for the removing the null value in the data set we use data.dropna() function we can reflect the data in to original bye the 
### using of inplace=True

In [17]:
data.isnull().sum()

Sales Person     0
Country          2
Product          3
Date             7
Amount           3
Boxes Shipped    2
dtype: int64

### data.fillna(any_data,inplace=True) this is use for filling the null value by some other data

In [18]:
x=data['Boxes Shipped'].mean()
# data['Boxes Shipped'].fillna(x)
data['Boxes Shipped']=data['Boxes Shipped'].fillna(x).astype(int)
data.describe()

                                Date  Boxes Shipped
count                           1087    1094.000000
mean   2022-05-03 11:51:23.348666112     161.908592
min              2022-01-03 00:00:00       1.000000
25%              2022-03-02 00:00:00      70.000000
50%              2022-05-11 00:00:00     135.000000
75%              2022-07-04 00:00:00     228.750000
max              2022-08-31 00:00:00     709.000000
std                              NaN     121.486398

In [19]:
# data.isnull().sum()
for d in data['Boxes Shipped']:
    if(d==161):
        print(d)

161
161

In [20]:
data.head()
(data['Boxes Shipped']==180)..sum()

SyntaxError: invalid syntax (1069081376.py, line 2)